<img src="https://pandas.pydata.org/static/img/pandas.svg" width="250">

## <center> Reshaping Dataframes

In [1]:
import pandas as pd

<img src="https://pandas.pydata.org/pandas-docs/stable/_images/reshaping_pivot.png">

Allows you to take a variable separating your rows and *pivot* that to your columns.

<b> Note:</b> does not support aggregation and therefore requires a unique index.

In [2]:
df = pd.DataFrame({"Region":['North','West','East','South','North','West','East','South'],
          "Team":['One','One','One','One','Two','Two','Two','Two'],
          "Revenue":[7500,5500,2750,6400,2300,3750,1900,575],
            "Cost":[5200,5100,4400,5300,1250,1300,2100,50]})
df

  Region Team  Revenue  Cost
0  North  One     7500  5200
1   West  One     5500  5100
2   East  One     2750  4400
3  South  One     6400  5300
4  North  Two     2300  1250
5   West  Two     3750  1300
6   East  Two     1900  2100
7  South  Two      575    50

In [3]:
df.pivot(index='Region',columns='Team',values='Revenue')
# pivot seems to be some sort of a pviot point that changes the look
# of the charts

Team     One   Two
Region
East    2750  1900
North   7500  2300
South   6400   575
West    5500  3750

<img src="https://pandas.pydata.org/pandas-docs/stable/_images/reshaping_stack.png">

Pivot a level of column labels to rows. Work with a multiindex.

In [4]:
df2 = df.set_index(['Region','Team'])

In [5]:
stacked = pd.DataFrame(df2.stack())
stacked
# stack seems to put a column into an index (row)

                        0
Region Team
North  One  Revenue  7500
            Cost     5200
West   One  Revenue  5500
            Cost     5100
East   One  Revenue  2750
            Cost     4400
South  One  Revenue  6400
            Cost     5300
North  Two  Revenue  2300
            Cost     1250
West   Two  Revenue  3750
            Cost     1300
East   Two  Revenue  1900
            Cost     2100
South  Two  Revenue   575
            Cost       50

<img src = "https://pandas.pydata.org/pandas-docs/stable/_images/reshaping_unstack.png">

Opposite of `stack` - pivots level of row labels to columns.

In [10]:
stacked.unstack('Region')
# stacked.unstack()
# unstack puts the indices back into columns
# you can determine which ones to put back

                 0
Region        East North South  West
Team
One  Revenue  2750  7500  6400  5500
     Cost     4400  5200  5300  5100
Two  Revenue  1900  2300   575  3750
     Cost     2100  1250    50  1300

<img src="https://pandas.pydata.org/pandas-docs/stable/_images/reshaping_melt.png">

Melt allows you to reformat your dataframe to identify columns as "ID variables", while transforming all other columns, or "measure variables" to the row level.

In [11]:
df.head(3)

  Region Team  Revenue  Cost
0  North  One     7500  5200
1   West  One     5500  5100
2   East  One     2750  4400

In [12]:
df.melt(id_vars=['Region','Team'], var_name='value type')
# non-id variables become row values, making every row
# specifically provide one type of information

   Region Team value type  value
0   North  One    Revenue   7500
1    West  One    Revenue   5500
2    East  One    Revenue   2750
3   South  One    Revenue   6400
4   North  Two    Revenue   2300
5    West  Two    Revenue   3750
6    East  Two    Revenue   1900
7   South  Two    Revenue    575
8   North  One       Cost   5200
9    West  One       Cost   5100
10   East  One       Cost   4400
11  South  One       Cost   5300
12  North  Two       Cost   1250
13   West  Two       Cost   1300
14   East  Two       Cost   2100
15  South  Two       Cost     50

### Supporting aggregation with `pivot_table`

In [13]:
# mean by default
df.pivot_table(index='Team',columns='Region',values='Revenue')

Region  East  North  South  West
Team
One     2750   7500   6400  5500
Two     1900   2300    575  3750